Repository: bykovk-pro/tgbot-logging
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: ru

source: API Reference
ru: Справочник API

source: This section provides detailed API documentation for the TGBot-Logging package.
ru: Этот раздел содержит подробную документацию по API пакета TGBot-Logging.

source: Configuration Options
ru: Параметры конфигурации

source: The TelegramHandler class accepts the following parameters:
ru: Класс TelegramHandler принимает следующие параметры:

source: Required Parameters
ru: Обязательные параметры

source: Telegram Bot API token obtained from @BotFather
ru: Токен Telegram Bot API, полученный от @BotFather

source: Single chat ID or list of chat IDs where messages will be sent
ru: Один ID чата или список ID чатов, куда будут отправляться сообщения

source: Optional Parameters
ru: Необязательные параметры

source: Minimum logging level (default: logging.NOTSET)
ru: Минимальный уровень логирования (по умолчанию: logging.NOTSET)

source: Message format string (default: None)
ru: Строка формата сообщения (по умолчанию: None)

source: Message parse mode ('HTML', 'MarkdownV2', None) (default: 'HTML')
ru: Режим разбора сообщения ('HTML', 'MarkdownV2', None) (по умолчанию: 'HTML')

source: Number of messages to batch before sending (default: 1)
ru: Количество сообщений для пакетной отправки (по умолчанию: 1)

source: Maximum time to wait before sending a batch (seconds) (default: 1.0)
ru: Максимальное время ожидания перед отправкой пакета (секунды) (по умолчанию: 1.0)

source: Maximum number of retries for failed messages (default: 3)
ru: Максимальное количество повторных попыток для неудачных сообщений (по умолчанию: 3)

source: Delay between retries (seconds) (default: 1.0)
ru: Задержка между повторными попытками (секунды) (по умолчанию: 1.0)

source: Project name to identify logs source (default: None)
ru: Имя проекта для идентификации источника логов (по умолчанию: None)

source: Emoji to use for project (default: '🔷')
ru: Эмодзи для проекта (по умолчанию: '🔷')

source: Whether to add project hashtag to messages (default: True)
ru: Добавлять ли хэштег проекта к сообщениям (по умолчанию: True)

source: Custom message format function (default: None)
ru: Пользовательская функция форматирования сообщений (по умолчанию: None)

source: Custom emoji mapping for log levels (default: None)
ru: Пользовательское сопоставление эмодзи для уровней логирования (по умолчанию: None)

source: Whether to include project name in message (default: True)
ru: Включать ли имя проекта в сообщение (по умолчанию: True)

source: Whether to include level emoji (default: True)
ru: Включать ли эмодзи уровня (по умолчанию: True)

source: Custom date format for timestamps (default: None)
ru: Пользовательский формат даты для временных меток (по умолчанию: None)

source: Default Level Emojis
ru: Эмодзи уровней по умолчанию

source: The handler comes with default emojis for different log levels:
ru: Обработчик поставляется с эмодзи по умолчанию для разных уровней логирования:

source: Custom Message Formatting
ru: Пользовательское форматирование сообщений

source: You can provide a custom message formatting function:
ru: Вы можете предоставить пользовательскую функцию форматирования сообщений:

source: Custom message formatting function.
ru: Пользовательская функция форматирования сообщений.

source: Args:
ru: Аргументы:

source: The logging record
ru: Запись логирования

source: Dictionary with formatting context
ru: Словарь с контекстом форматирования

source: Returns:
ru: Возвращает:

source: str: Formatted message
ru: str: Отформатированное сообщение

source: The context dictionary provides:
ru: Словарь контекста предоставляет:

source: Error Handling
ru: Обработка ошибок

source: The handler includes built-in error handling for:
ru: Обработчик включает встроенную обработку ошибок для:

source: Rate limiting (RetryAfter)
ru: Ограничение частоты (RetryAfter)

source: Network timeouts
ru: Сетевые таймауты

source: Message sending failures
ru: Ошибки отправки сообщений

source: Invalid tokens or chat IDs
ru: Недействительные токены или ID чатов

source: All errors are handled gracefully with automatic retries where appropriate.
ru: Все ошибки обрабатываются корректно с автоматическими повторными попытками, где это уместно.
