Repository: bykovk-pro/tgbot-logging
Catalog: docs/locale/*/LC_MESSAGES/development.po
Languages: ru

source: Development Guide
ru: Руководство разработчика

source: This guide will help you set up your development environment and contribute to TGBot-Logging.
ru: Это руководство поможет вам настроить среду разработки и внести свой вклад в TGBot-Logging.

source: Development Setup
ru: Настройка среды разработки

source: Clone the repository:
ru: Клонируйте репозиторий:

source: Create and activate a virtual environment:
ru: Создайте и активируйте виртуальное окружение:

source: Install development dependencies:
ru: Установите зависимости для разработки:

source: Project Structure
ru: Структура проекта

source: Testing
ru: Тестирование

source: Run tests using pytest:
ru: Запустите тесты с помощью pytest:

source: For manual testing, you can use the test bot script:
ru: Для ручного тестирования вы можете использовать скрипт тестового бота:

source: Code Style
ru: Стиль кода

source: We use the following tools for code formatting and linting:
ru: Мы используем следующие инструменты для форматирования и проверки кода:

source: black - Code formatter
ru: black - Форматировщик кода

source: isort - Import sorter
ru: isort - Сортировщик импортов

source: flake8 - Style guide enforcement
ru: flake8 - Проверка соответствия стилю

source: Format your code:
ru: Отформатируйте ва�� код:

source: Documentation
ru: Документация

source: Build documentation locally:
ru: Соберите документацию локально:

source: View the documentation:
ru: Просмотрите документацию:

source: Building and Distribution
ru: Сборка и распространение

source: Build the package:
ru: Соберите пакет:

source: Upload to PyPI:
ru: Загрузите на PyPI:

source: Contributing
ru: Внесение вклада

source: Fork the repository
ru: Сделайте форк репозитория

source: Create a feature branch
ru: Создайте ветку для функционала

source: Make your changes
ru: Внесите ваши изменения

source: Run tests and linting
ru: Запустите тесты и проверку кода

source: Submit a pull request
ru: Отправьте pull request

source: Pull Request Guidelines
ru: Рекомендации по Pull Request

source: Include tests for new features
ru: Включите тест�� для новых функций

source: Update documentation as needed
ru: Обновите документацию при необходимости

source: Follow the existing code style
ru: Следуйте существующему стилю кода

source: Write clear commit messages
ru: Пишите понятные сообщения коммитов

source: Add yourself to CONTRIBUTORS.md
ru: Добавьте себя в CONTRIBUTORS.md

source: Security
ru: Безопасность

source: Never commit sensitive data (tokens, passwords, etc.)
ru: Никогда не коммитьте конфиденциальные данные (токены, пароли и т.д.)

source: Use environment variables for configuration
ru: Используйте переменные окружения для конфигурации

source: Report security issues privately
ru: Сообщайте о проблемах безопасности приватно

source: Keep dependencies up to date
ru: Поддерживайте зависимости в актуальном состоянии

source: Release Process
ru: Процесс релиза

source: Update CHANGELOG.md
ru: Обновите CHANGELOG.md

source: Update version number
ru: Обновите номер версии

source: Create release branch
ru: Создайте ветку релиза

source: Run full test suite
ru: Запустите полный набор тестов

source: Build and test package
ru: Соберите и протестируйте пакет

source: Create GitHub release
ru: Создайте релиз на GitHub

source: Upload to PyPI
ru: Загрузите на PyPI

source: Troubleshooting
ru: Устранение проблем

source: Common Issues
ru: Частые проблемы

source: Rate Limiting
ru: Ограничение частоты

source: Telegram has rate limits for bots
ru: Telegram имеет ограничения частоты для ботов

source: Use batch_size and batch_interval
ru: Используйте batch_size и batch_interval

source: Handle RetryAfter exceptions
ru: Обрабатывайте исключения RetryAfter

source: Message Formatting
ru: Форматирование сообщений

source: HTML and MarkdownV2 have specific requirements
ru: HTML и MarkdownV2 имеют специфические требования

source: Escape special characters
ru: Экранируйте специальные символы

source: Test formatting in Telegram first
ru: Сначала тестируйте форматирование в Telegram

source: Environment Variables
ru: Переменные окружения

source: Check .env file location
ru: Проверьте расположение файла .env

source: Verify variable names
ru: Проверьте имена переменных

source: Use correct data types
ru: Используйте правильные типы данных

source: Getting Help
ru: Получение помощи

source: Open an issue on GitHub
ru: Откройте issue на GitHub

source: Check existing issues
ru: Проверьте существующие issues

source: Read the FAQ
ru: Прочитайте FAQ

source: Join our Telegram group
ru: Присоединитесь к нашей группе в Telegram
