Repository: bykovk-pro/tgbot-logging
Catalog: docs/locale/*/LC_MESSAGES/examples.po
Languages: ru

source: Examples
ru: Примеры

source: Basic Usage
ru: Базовое использование

source: Here's a basic example of using TGBot-Logging:
ru: Вот базовый пример использования TGBot-Logging:

source: Custom Formatting
ru: Пользовательское форматирование

source: You can customize the message format using HTML or MarkdownV2:
ru: Вы можете настроить формат сообщения, используя HTML или MarkdownV2:

source: HTML Example
ru: Пример HTML

source: MarkdownV2 Example
ru: Пример MarkdownV2

source: Message Batching
ru: Пакетная отправка сообщений

source: To improve performance, you can batch multiple messages:
ru: Для улучшения производительности вы можете отправлять сообщения пакетами:

source: Environment Variables
ru: Переменные окружения

source: Using environment variables for configuration:
ru: Использование переменных окружения для конфигурации:

source: Custom Error Handling
ru: Пользовательская обработка ошибок

source: Example of custom error handling:
ru: Пример пользовательской обработки ошибок:

source: Advanced Features
ru: Расширенные возможности

source: Multiple Chat IDs
ru: Несколько ID чатов

source: You can send logs to multiple Telegram chats:
ru: Вы можете отправлять логи в несколько чатов Telegram:

source: Custom Emoji Mapping
ru: Пользовательское сопоставление эмодзи

source: Define your own emojis for log levels:
ru: Определите свои собственные эмодзи для уровней логирования:

source: Custom Message Formatter
ru: Пользовательский форматировщик сообщений

source: Create a custom message formatter function:
ru: Создайте пользовательскую функцию форматирования сообщений:

source: Async Usage
ru: Асинхронное использование

source: Using TGBot-Logging in async applications:
ru: Использование TGBot-Logging в асинхронных приложениях:

source: Testing Examples
ru: Примеры тестирования

source: Example of testing with TGBot-Logging:
ru: Пример тестирования с TGBot-Logging:

source: Production Configuration
ru: Конфигурация для продакшена

source: Example of a production-ready configuration:
ru: Пример конфигурации, готовой к продакшену:

source: Development Configuration
ru: Конфигурация для разработки

source: Example of a development configuration:
ru: Пример конфигурации для разработки:
