Repository: bykovk-pro/tgbot-logging
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Welcome to TGBot-Logging's documentation!
ru: Добро пожаловать в документацию TGBot-Logging!

source: Features
ru: Возможности

source: Send log messages to one or multiple Telegram chats
ru: Отправка сообщений логов в один или несколько чатов Telegram

source: Support for HTML and MarkdownV2 formatting
ru: Поддержка форматирования HTML и MarkdownV2

source: Message batching for better performance
ru: Пакетная отправка сообщений для лучшей производительности

source: Automatic retries for failed messages
ru: Автоматические повторные попытки для неудачных сообщений

source: Rate limiting and error handling
ru: Ограничение частоты и обработка ошибок

source: Customizable log format and emojis
ru: Настраиваемый формат логов и эмодзи

source: Support for project names and hashtags
ru: Поддержка имен проектов и хэштегов

source: Environment variables support
ru: Поддержка переменных окружения

source: Async/await support
ru: Поддержка async/await

source: Installation
ru: Установка

source: Basic Installation (Production)
ru: Базовая установка (для продакшена)

source: For basic usage in production environment:
ru: Для базового использования в продакшен-окружении:

source: Development Installation
ru: Установка для разработки

source: For development with testing tools and code formatting:
ru: Для разработки с инструментами тестирования и форматирования кода:

source: Documentation Tools
ru: Инструменты документации

source: For building documentation:
ru: Для сборки документации:

source: Build Tools
ru: Инструменты сборки

source: For package building and distribution:
ru: Для сборки и распространения пакета:

source: Full Installation
ru: Полная установка

source: For all optional dependencies:
ru: Для всех опциональных зависимостей:

source: Indices and tables
ru: Индексы и таблицы

source: Features in Detail
ru: Подробное описание возможностей

source: Message Formatting
ru: Форматирование сообщений

source: Custom message formats with templates
ru: Пользовательские форматы сообщений с шаблонами

source: Custom date/time formats
ru: Пользовательские форматы даты/времени

source: Project names and emojis
ru: Имена проектов и эмодзи

source: Automatic hashtags
ru: Автоматические хэштеги

source: Level-specific emojis
ru: Эмодзи для разных уровней логирования

source: Message Batching
ru: Пакетная отправка сообщений

source: Configurable batch size
ru: Настраиваемый размер пакета

source: Configurable batch interval
ru: Настраиваемый интервал пакетов

source: Automatic batch flushing
ru: Автоматическая отправка пакетов

source: Memory-efficient queue system
ru: Эффективная система очередей

source: Error Handling
ru: Обработка ошибок

source: Rate limit handling
ru: Обработка ограничений частоты

source: Network error handling
ru: Обработка сетевых ошибок

source: Timeout handling
ru: Обработка таймаутов

source: Graceful error recovery
ru: Плавное восстановление после ошибок

source: Performance
ru: Производительность

source: Asynchronous message sending
ru: Асинхронная отправка сообщений

source: Message batching
ru: Пакетная отправка сообщений

source: Rate limiting
ru: Ограничение частоты

source: Memory optimization
ru: Оптимизация памяти

source: Cross-platform compatibility
ru: Кроссплатформенная совместимость

source: Development Features
ru: Возможности для разработки

source: Type hints for better IDE support
ru: Подсказки типов для лучшей поддержки IDE

source: Comprehensive test suite (96% coverage)
ru: Полный набор тестов (96% покрытия)

source: Detailed documentation
ru: Подробная документация

source: Code style compliance (Black)
ru: Соответствие стилю кода (Black)

source: Security checks (Bandit)
ru: Проверки безопасности (Bandit)
