Repository: bykovk-pro/tgbot-logging
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: ru

source: Quick Start Guide
ru: Руководство по быстрому старту

source: This guide will help you get started with TGBot-Logging quickly.
ru: Это руководство поможет вам быстро начать работу с TGBot-Logging.

source: Setup
ru: Настройка

source: Create a Telegram bot:
ru: Создайте бота в Telegram:

source: Open @BotFather in Telegram
ru: Откройте @BotFather в Telegram

source: Send /newbot command
ru: Отправьте команду /newbot

source: Follow instructions to create a bot
ru: Следуйте инструкциям для создания бота

source: Copy the bot token (it looks like 123456789:ABCdefGHIjklmNOPqrstUVwxyz)
ru: Скопируйте токен бота (он выглядит как 123456789:ABCdefGHIjklmNOPqrstUVwxyz)

source: Get your chat ID:
ru: Получите ID вашего чата:

source: Start a chat with your bot
ru: Начните чат с вашим ботом

source: Send any message to the bot
ru: Отправьте любое сообщение боту

source: Open @userinfobot
ru: Откройте @userinfobot

source: Copy your chat ID (it's a number like 123456789)
ru: Скопируйте ID вашего чата (это число, например 123456789)

source: Configure environment variables:
ru: Настройте переменные окружения:

source: Copy .env.example to .env
ru: Скопируйте .env.example в .env

source: Replace placeholder values with your actual credentials
ru: Замените значения-заполнители на ваши реальные учетные данные

source: Never commit .env file to version control
ru: Никогда не коммитьте файл .env в систему контроля версий

source: Basic Usage
ru: Базовое использование

source: Here's a minimal example to get you started:
ru: Вот минимальный пример для начала работы:

source: Using Environment Variables
ru: Использование переменных окружения

source: You can use environment variables for configuration:
ru: Вы можете использовать переменные окружения для конфигурации:

source: Message Formatting
ru: Форматирование сообщений

source: HTML Formatting:
ru: HTML форматирование:

source: MarkdownV2 Formatting:
ru: MarkdownV2 форматирование:

source: Next Steps
ru: Следующие шаги

source: Check out the configuration section for detailed configuration options
ru: Ознакомьтесь с разделом конфигурации для подробных настроек

source: See examples for more advanced usage examples
ru: Посмотрите примеры для более продвинутого использования

source: Read the api documentation for complete API reference
ru: Прочитайте документацию API для полного справочника по API
